[
  {
    "_id": "1",
    "title": "Senior Software Engineer",
    "company": "Google",
    "location": "Mountain View, CA",
    "salary": "$120,000 - $180,000",
    "type": "Full-time",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Google_2015_logo.svg",
    "description": "Join Google to build products that help create opportunities for everyone. We're looking for talented engineers to work on cutting-edge technologies.",
    "requirements": "Bachelor's degree in Computer Science or equivalent practical experience. 5+ years of experience with software development in one or more programming languages. Experience with data structures, algorithms, and software design.",
    "responsibilities": "Design, develop, test, deploy, maintain, and improve software. Manage individual project priorities, deadlines, and deliverables. Participate in design reviews with peers and stakeholders.",
    "benefits": "Competitive salary, comprehensive health coverage, retirement savings plan, flexible work arrangements, professional development opportunities.",
    "jobDescription": "As a Senior Software Engineer at Google, you'll work on a specific project critical to Google's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and improve software solutions.",
    "createdAt": "2024-01-15T10:00:00Z",
    "experience": "5+ years",
    "skills": ["JavaScript", "Python", "Java", "System Design", "Algorithms"]
  },
  {
    "_id": "2",
    "title": "Product Manager",
    "company": "Microsoft",
    "location": "Redmond, WA",
    "salary": "$110,000 - $160,000",
    "type": "Full-time",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/4/44/Microsoft_logo.svg",
    "description": "Drive product strategy and execution for Microsoft Azure services. Lead cross-functional teams to deliver innovative cloud solutions.",
    "requirements": "Bachelor's degree in Business, Engineering, or related field. 3+ years of product management experience. Strong analytical and problem-solving skills.",
    "responsibilities": "Define product roadmap and strategy. Collaborate with engineering, design, and marketing teams. Analyze market trends and customer feedback.",
    "benefits": "Competitive compensation, stock options, comprehensive healthcare, flexible work options, learning and development budget.",
    "jobDescription": "We are seeking a dynamic Product Manager to join our Azure team. You will be responsible for driving the product strategy and roadmap for key Azure services, working closely with engineering teams to deliver world-class cloud solutions.\n\nIn this role, you will define product requirements, prioritize features, and ensure successful product launches. You'll work with customers, partners, and internal stakeholders to understand market needs and translate them into actionable product plans.",
    "createdAt": "2024-01-14T09:30:00Z",
    "experience": "3+ years",
    "skills": ["Product Strategy", "Azure", "Analytics", "Leadership", "Agile"]
  },
  {
    "_id": "3",
    "title": "Data Scientist",
    "company": "Amazon",
    "location": "Seattle, WA",
    "salary": "$130,000 - $190,000",
    "type": "Full-time",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Amazon_logo.svg",
    "description": "Use machine learning to solve complex business problems at scale. Work with petabytes of data to drive business insights.",
    "requirements": "Master's degree in Statistics, Mathematics, Computer Science, or related field. 4+ years of experience in data science. Proficiency in Python, R, SQL.",
    "responsibilities": "Build and deploy machine learning models. Analyze large datasets to extract business insights. Collaborate with product and engineering teams.",
    "benefits": "Competitive salary, RSUs, comprehensive benefits, career development programs, innovation time.",
    "jobDescription": "Amazon is looking for a passionate Data Scientist to join our team and help us leverage data to make better business decisions. You will work on challenging problems using machine learning, statistical analysis, and data mining techniques.\n\nYou'll be responsible for building predictive models, conducting A/B tests, and providing data-driven recommendations to senior leadership. This role offers the opportunity to work with cutting-edge technologies and massive datasets.",
    "createdAt": "2024-01-13T14:20:00Z",
    "experience": "4+ years",
    "skills": ["Python", "Machine Learning", "SQL", "Statistics", "AWS"]
  },
  {
    "_id": "4",
    "title": "Frontend Developer",
    "company": "Meta",
    "location": "Menlo Park, CA",
    "salary": "$115,000 - $170,000",
    "type": "Full-time",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Meta_Platforms_Inc._logo.svg",
    "description": "Build the next generation of social technology at Meta. Create engaging user experiences for billions of users worldwide.",
    "requirements": "Bachelor's degree in Computer Science or equivalent experience. 3+ years of frontend development experience. Expertise in React, JavaScript, CSS.",
    "responsibilities": "Develop user-facing features using React. Optimize applications for maximum speed and scalability. Collaborate with designers and backend engineers.",
    "benefits": "Competitive compensation, equity, health benefits, wellness programs, learning stipend.",
    "jobDescription": "Join Meta's frontend engineering team and help build products that connect billions of people around the world. You'll work on cutting-edge web technologies and create intuitive, performant user interfaces.\n\nAs a Frontend Developer, you'll collaborate with cross-functional teams to implement new features, optimize performance, and ensure excellent user experiences across our family of apps.",
    "createdAt": "2024-01-12T11:45:00Z",
    "experience": "3+ years",
    "skills": ["React", "JavaScript", "CSS", "HTML", "GraphQL"]
  },
  {
    "_id": "5",
    "title": "iOS Developer",
    "company": "Apple",
    "location": "Cupertino, CA",
    "salary": "$125,000 - $185,000",
    "type": "Full-time",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Apple_logo_black.svg",
    "description": "Create amazing experiences for millions of Apple users worldwide. Work on innovative iOS applications and frameworks.",
    "requirements": "Bachelor's degree in Computer Science or related field. 4+ years of iOS development experience. Proficiency in Swift and Objective-C.",
    "responsibilities": "Design and implement iOS applications. Collaborate with design and product teams. Optimize app performance and user experience.",
    "benefits": "Competitive salary, stock options, comprehensive healthcare, employee discounts, wellness programs.",
    "jobDescription": "Apple is seeking a talented iOS Developer to join our team and help create the next generation of mobile experiences. You'll work on apps used by millions of people worldwide and contribute to the iOS ecosystem.\n\nIn this role, you'll design and implement new features, work closely with designers to create beautiful interfaces, and ensure our apps meet Apple's high standards for quality and performance.",
    "createdAt": "2024-01-11T16:10:00Z",
    "experience": "4+ years",
    "skills": ["Swift", "Objective-C", "iOS SDK", "Xcode", "UIKit"]
  },
  {
    "_id": "6",
    "title": "DevOps Engineer",
    "company": "Netflix",
    "location": "Los Gatos, CA",
    "salary": "$140,000 - $200,000",
    "type": "Full-time",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/0/08/Netflix_2015_logo.svg",
    "description": "Scale Netflix streaming platform to serve millions globally. Build and maintain infrastructure that powers entertainment for the world.",
    "requirements": "Bachelor's degree in Engineering or related field. 5+ years of DevOps experience. Expertise in AWS, Kubernetes, Docker.",
    "responsibilities": "Design and maintain scalable infrastructure. Implement CI/CD pipelines. Monitor system performance and reliability.",
    "benefits": "Competitive compensation, unlimited PTO, comprehensive benefits, stock options, learning budget.",
    "jobDescription": "Netflix is looking for a DevOps Engineer to help us scale our streaming platform and deliver entertainment to millions of users worldwide. You'll work with cutting-edge technologies and solve complex infrastructure challenges.\n\nYou'll be responsible for building and maintaining our cloud infrastructure, implementing automation tools, and ensuring high availability and performance of our services.",
    "createdAt": "2024-01-10T13:25:00Z",
    "experience": "5+ years",
    "skills": ["AWS", "Kubernetes", "Docker", "Terraform", "Python"]
  }
]